app/Controllers/Apps/DEM.php

    public function index()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'christianchrcs@gmail.com'
 LIMIT 1

    public function chat_list()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'christianchrcs@gmail.com'
 LIMIT 1

    public function artikel_list()
    {
        $perPage = 6; // Jumlah artikel per halaman

        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'christianchrcs@gmail.com'
 LIMIT 1

    public function guladarah_list()
    {

        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'christianchrcs@gmail.com'
 LIMIT 1