app/Controllers/Apps/DEMA.php

    public function index()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'sa@mail.com'
 LIMIT 1

    public function artikel_list()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'sa@mail.com'
 LIMIT 1

    public function artikel_add_control()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'sa@mail.com'
 LIMIT 1

    public function akun_list()
    {
        $data['user'] = $this->UserModel->where('username', session()->get('username'))->first();
---
SELECT *
FROM `user`
WHERE `username` = 'sa@mail.com'
 LIMIT 1