app/Models/ArtikelDEMModel.php

SELECT *
FROM `tbl_artikel`
ORDER BY `created_date` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tbl_artikel`
---
    public function get_all_artikel($limit)
    {
        return $this->orderBy('created_date', 'DESC') // Urutkan berdasarkan tanggal terbaru
            ->paginate($limit, 'artikel_pagination');