app/Models/ArtikelModel.php

SELECT *
FROM `tbl_artikel`
---
    public function get_all_artikel()
    {
        $builder = $this->db->table('tbl_artikel');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `tbl_artikel`
---
    public function jumlah_artikel()
    {
        $builder = $this->db->table('tbl_artikel');
        $num_rows = $builder->countAllResults();