app/Models/GulaModel.php

SELECT *
FROM `tbl_guladarah`
WHERE `ak` = 'Y2hyaXN0aWFuY2hyY3NAZ21haWwuY29t'
---
    public function get_guladarah_by_user($user)
    {
        $builder = $this->db->table('tbl_guladarah');
        $builder->where('ak', $user);
        $query = $builder->get();

SELECT *
FROM `tbl_guladarah`
WHERE `ak` = 'Y2hyaXN0aWFuY2hyY3NAZ21haWwuY29t'
ORDER BY `tanggal` DESC
---
    public function get_guladarah_by_user_top($user)
    {
        $builder = $this->db->table('tbl_guladarah');
        $builder->orderBy('tanggal', 'DESC');
        $builder->where('ak', $user);
        $query = $builder->get();