app/Models/UserMModel.php

    public function get_all_user()
    {
        $builder = $this->db->table('user');
        $builder->where('id<>', 1);
        $query = $builder->get();
---
SELECT *
FROM `user`
WHERE `id` <> 1

    public function jumlah_akun()
    {
        $builder = $this->db->table('user');
        $builder->where('id<>', 1);
        $num_rows = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `id` <> 1